#ifndef __CONNECT_H
#define __CONNECT_H

#define TO_STR(x) #x

// 第一条：任何使用到胶水运算“##”对形参进行粘合的参数宏，一定需要额外的再套一层
// 第二条：其余情况下，如果要用到胶水运算，一定要在内部借助参数宏来完成粘合过程

#define __CONNECT2(__0, __1                                    ) __0##__1
#define __CONNECT3(__0, __1, __2                               ) __0##__1##__2
#define __CONNECT4(__0, __1, __2, __3                          ) __0##__1##__2##__3
#define __CONNECT5(__0, __1, __2, __3, __4                     ) __0##__1##__2##__3##__4
#define __CONNECT6(__0, __1, __2, __3, __4, __5                ) __0##__1##__2##__3##__4##__5
#define __CONNECT7(__0, __1, __2, __3, __4, __5, __6           ) __0##__1##__2##__3##__4##__5##__6
#define __CONNECT8(__0, __1, __2, __3, __4, __5, __6, __7      ) __0##__1##__2##__3##__4##__5##__6##__7
#define __CONNECT9(__0, __1, __2, __3, __4, __5, __6, __7, __8 ) __0##__1##__2##__3##__4##__5##__6##__7##__8

#define CONNECT2(__0, __1                                    ) __CONNECT2(__0, __1)
#define CONNECT3(__0, __1, __2                               ) __CONNECT3(__0, __1, __2)
#define CONNECT4(__0, __1, __2, __3                          ) __CONNECT4(__0, __1, __2, __3)
#define CONNECT5(__0, __1, __2, __3, __4                     ) __CONNECT5(__0, __1, __2, __3, __4)
#define CONNECT6(__0, __1, __2, __3, __4, __5                ) __CONNECT6(__0, __1, __2, __3, __4, __5)
#define CONNECT7(__0, __1, __2, __3, __4, __5, __6           ) __CONNECT7(__0, __1, __2, __3, __4, __5, __6)
#define CONNECT8(__0, __1, __2, __3, __4, __5, __6, __7      ) __CONNECT8(__0, __1, __2, __3, __4, __5, __6, __7)
#define CONNECT9(__0, __1, __2, __3, __4, __5, __6, __7, __8 ) __CONNECT9(__0, __1, __2, __3, __4, __5, __6, __7, __8)


#define VA_NUM_ARGS_IMPL(_1,_2,_3,_4,_5,_6,_7,_8,_9,__N,...) __N
#define VA_NUM_ARGS(...)	VA_NUM_ARGS_IMPL(__VA_ARGS__,9,8,7,6,5,4,3,2,1)

#define CONNECT(...)	CONNECT2(CONNECT, VA_NUM_ARGS(__VA_ARGS__))(__VA_ARGS__)                               

#endif
